tests/api.load.yaml
config:
  ensure:
    - p99: 50
  target: "http://localhost:8010"
  phases:
    - duration: 30
      arrivalRate: 440
      maxVusers: 440
      name: 'load'
scenarios:
  - name: "health"
    flow:
      - get:
          url: "/health"
  - name: "get all rides"
    flow:
      - get:
          headers:
            User-Agent: Artillery
          url: "/rides?page=0&perPage=10"
  - name: "insert rides"
    flow:
      - post:
          url: "/rides"
          headers:
            User-Agent: Artillery
          json:
            startLatitude: 0.0
            startLongitude: 0.0
            endLatitude: 0.5
            endLongitude: 0.5
            riderName: "riderName"
            driverName: "driverName"
            driverVehicle: "driverVehicle"
  - name: "get specific rides"
    flow:
      - get:
          headers:
            User-Agent: Artillery
          url: "/rides/1"